app/controllers/movies_controller.rb

  def index
    #@ratings = {"G" => "1", "PG" => "1", "PG-13" => "1", "R" => "1"}
    @sort = params[:sort]
    #@movies = Movie.where("rating in (?)", @ratings.keys)
    @movies = Movie.all
    if !@sort.nil?
      @movies = Movie.find(:all, :order => "#{@sort}")
---
SELECT "movies".* FROM "movies" ORDER BY release_date ASC
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", {"G"=>1, "PG"=>1, "PG-13"=>1, "R"=>1}]]