app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.ratings
    @sort = params[:sort]
    @ratings = params[:ratings]

    if params[:ratings].nil?
      @ratings = {"G"=>1,"PG"=>1,"PG-13"=>1,"R"=>1}
    end

    if !@sort.nil?
      @movies = Movie.order("#{@sort} ASC").find_all_by_rating(@ratings.keys)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG-13', 'R') ORDER BY '--- !map:ActiveSupport::HashWithIndifferentAccess

  def create
    @movie = Movie.create!(params[:movie])
---
INSERT INTO "movies" ("created_at", "description", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)